; domain
(define (domain satellite)

(:requirements
    :typing
    :fluents
    :negative-preconditions
    :conditional-effects
    :equality
)

; ==========================================================
; TYPES
; ==========================================================

(:types
    object
    direction
)

; ==========================================================
; DIRECTIONS
; ==========================================================

(:constants
    n ne e se s sw w nw - direction
)

; ==========================================================
; PREDICATES
; ==========================================================

(:predicates

    ; orientamento satellite
    (pointing ?d - direction)

    ; evita oscillazioni
    (last-dir ?d - direction)

    ; visibilità oggetti
    (visible ?o - object ?d - direction)

    ; stato invio
    (taken ?o - object)
    (sent ?o - object)

    ; qualità oggetto (NON della foto)
    (quality-hd ?o - object)
    (quality-sd ?o - object)

    ; grafo direzioni
    (next-right ?from ?to - direction)
    (next-left ?from ?to - direction)
)

; ==========================================================
; FUNCTIONS
; ==========================================================

(:functions
    (energy)
    (memory-used)
    (memory-capacity)
    (photo-count)
    (rotation-cost)
)

; ==========================================================
; ROTATE RIGHT
; ==========================================================

(:action rotate-right
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-right ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; ROTATE LEFT
; ==========================================================

(:action rotate-left
    :parameters (?from ?to - direction)

    :precondition (and
        (pointing ?from)
        (next-left ?from ?to)
        (>= (energy) 1)
        (not (last-dir ?to))
    )

    :effect (and
        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)
        (decrease (energy) 1)
    )
)

; ==========================================================
; TAKE PICTURE (UNICA)
; ==========================================================

(:action take-picture

    :parameters (?o - object ?d - direction)

    :precondition (and
        (pointing ?d)
        (visible ?o ?d)

        (not (taken ?o))
        (not (sent ?o))

        (>= (energy) 2)

        (< (photo-count) 2)

        (<= (+ (memory-used) 10) (memory-capacity))
    )

    :effect (and

        (taken ?o)
        (increase (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (increase (memory-used) 10)
        )

        (when (quality-sd ?o)
            (increase (memory-used) 3)
        )
    )
)

; ==========================================================
; SEND
; ==========================================================

(:action send
    :parameters (?o - object)

    :precondition (and
        (pointing n)
        (taken ?o)
        (not (sent ?o))
        (>= (energy) 2)
    )

    :effect (and
        (sent ?o)
        (not (taken ?o))

        (decrease (photo-count) 1)
        (decrease (energy) 2)

        (when (quality-hd ?o)
            (decrease (memory-used) 10)
        )

        (when (quality-sd ?o)
            (decrease (memory-used) 3)
        )
    )
)

)

; problem
(define (problem satellite-hard)
(:domain satellite)

(:objects
    star1 planet1 galaxy1 dust1 junk2 - object
)

(:init

    (pointing sw)
    (last-dir sw)

    (visible star1 e)
    (visible planet1 s)
    (visible galaxy1 nw)

    (quality-sd star1)
    (quality-sd planet1)
    (quality-sd galaxy1)

    (= (energy) 75)
    (= (memory-used) 0)
    (= (memory-capacity) 16)
    (= (photo-count) 0)
    (= (rotation-cost) 0)

    (next-right n ne)
    (next-right ne e)
    (next-right e se)
    (next-right se s)
    (next-right s sw)
    (next-right sw w)
    (next-right w nw)
    (next-right nw n)

    (next-left ne n)
    (next-left e ne)
    (next-left se e)
    (next-left s se)
    (next-left sw s)
    (next-left w sw)
    (next-left nw w)
    (next-left n nw)
)

(:goal
    (and
        (sent star1)
        (sent planet1)
        (sent galaxy1)
    )
)

(:metric minimize (+ (energy) (rotation-cost)))
)

; plan
1. (rotate-left sw s)
   deleted: (pointing sw) (last-dir sw)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 0 to 2, (energy) from 75 to 74
   goals met: 0 of 3
2. (take-picture planet1 s)
   added: (taken planet1)
   changed: (photo-count) from 0 to 1, (energy) from 74 to 72, (memory-used) from 0 to 3
   goals met: 0 of 3
3. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 2 to 4, (energy) from 72 to 71
   goals met: 0 of 3
4. (rotate-left se e)
   deleted: (pointing se) (last-dir se)
   added: (pointing e) (last-dir e)
   changed: (rotation-cost) from 4 to 6, (energy) from 71 to 70
   goals met: 0 of 3
5. (take-picture star1 e)
   added: (taken star1)
   changed: (photo-count) from 1 to 2, (energy) from 70 to 68, (memory-used) from 3 to 6
   goals met: 0 of 3
6. (rotate-left e ne)
   deleted: (pointing e) (last-dir e)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 6 to 8, (energy) from 68 to 67
   goals met: 0 of 3
7. (rotate-left ne n)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 8 to 10, (energy) from 67 to 66
   goals met: 0 of 3
8. (send planet1)
   deleted: (taken planet1)
   added: (sent planet1)
   changed: (photo-count) from 2 to 1, (energy) from 66 to 64, (memory-used) from 6 to 3
   goals met: 1 of 3
9. (rotate-left n nw)
   deleted: (pointing n) (last-dir n)
   added: (pointing nw) (last-dir nw)
   changed: (rotation-cost) from 10 to 12, (energy) from 64 to 63
   goals met: 1 of 3
10. (take-picture galaxy1 nw)
   added: (taken galaxy1)
   changed: (photo-count) from 1 to 2, (energy) from 63 to 61, (memory-used) from 3 to 6
   goals met: 1 of 3
11. (rotate-right nw n)
   deleted: (pointing nw) (last-dir nw)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 12 to 14, (energy) from 61 to 60
   goals met: 1 of 3
12. (send galaxy1)
   deleted: (taken galaxy1)
   added: (sent galaxy1)
   changed: (photo-count) from 2 to 1, (energy) from 60 to 58, (memory-used) from 6 to 3
   goals met: 2 of 3
13. (send star1)
   deleted: (taken star1)
   added: (sent star1)
   changed: (photo-count) from 1 to 0, (energy) from 58 to 56, (memory-used) from 3 to 0
   goals met: 3 of 3
